_posts/2020-11-18-scala-3-context-functions.html
---
layout: post
title: Scala 3 Context Functions
tags: [scala, scala-3, dotty]
---
<link rel="stylesheet" type="text/css" href="../../../_orgcss/site.css" />
<div id="outline-container-orgf6c3f62" class="outline-2">
<h2 id="orgf6c3f62">Some Scala 3 Things: Context functions, Enums and significant whitespace</h2>
<div class="outline-text-2" id="text-orgf6c3f62">
<p>
<code>Updated: for Scala 3.0.0-M3 `as` keyword was removed</code>
</p>

<p>
This is the companion blog for my first Functional Justin video which you can find here <a href="https://youtu.be/J01u_Dmrx5U">https://youtu.be/J01u_Dmrx5U</a>. I spend around 15 minutes adding some Scala 3 (formerly Dotty) features to an Scala 2 program.
</p>

<p>
The program itself builds a simple Algebraic Data Type (ADT) to represent a simple arithmetic expressions. We can then build expressions in this <code>algebra</code> and evaluate it using an eval function using pattern matching&#x2026;
</p>

<div class="org-src-container">
<pre class="src src-scala"><span style="color: #f78fe7;">sealed</span> <span style="color: #b6a0ff;">trait</span> <span style="color: #6ae4b9;">Exp</span>
<span style="color: #b6a0ff;">case</span> <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">Val</span>(value<span style="color: #b6a0ff;">:</span> <span style="color: #6ae4b9;">Int</span>) <span style="color: #b6a0ff;">extends</span> <span style="color: #6ae4b9;">Exp</span>
<span style="color: #b6a0ff;">case</span> <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">Add</span>(left<span style="color: #b6a0ff;">:</span> <span style="color: #6ae4b9;">Exp</span>, right<span style="color: #b6a0ff;">:</span> <span style="color: #6ae4b9;">Exp</span>) <span style="color: #b6a0ff;">extends</span> <span style="color: #6ae4b9;">Exp</span>
<span style="color: #b6a0ff;">case</span> <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">Mul</span>(left<span style="color: #b6a0ff;">:</span> <span style="color: #6ae4b9;">Exp</span>, right<span style="color: #b6a0ff;">:</span> <span style="color: #6ae4b9;">Exp</span>) <span style="color: #b6a0ff;">extends</span> <span style="color: #6ae4b9;">Exp</span>
<span style="color: #b6a0ff;">case</span> <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">Var</span>(identifier<span style="color: #b6a0ff;">:</span> <span style="color: #6ae4b9;">String</span>) <span style="color: #b6a0ff;">extends</span> <span style="color: #6ae4b9;">Exp</span>
</pre>
</div>

<p>
Now given an expression like <code>Mul(Var("z"), Add(Val(30), Mul(Var("x"), Var("y"))))</code> I'd like to be able to recursively traverse it and calculate a final Int value at the end.
</p>

<p>
<code>Val</code> represents an Int value, whilst <code>Add</code> and <code>Mul</code> take care of addition and multiplication. You could go ahead and add more functions. <code>Var</code> is interesting because it takes an a string identifier (i.e., a variable name) and will look it up in an environment. The environment is represented a Scala map of String to Int.
</p>

<div class="org-src-container">
<pre class="src src-scala"><span style="color: #b6a0ff;">type</span> <span style="color: #00bcff;">Env</span> <span style="color: #b6a0ff;">=</span> <span style="color: #00bcff;">Map</span>[<span style="color: #00bcff;">String</span>, <span style="color: #00bcff;">Int</span>]
</pre>
</div>

<p>
For the eval function we just use a pattern match to dispatch to functions that handle each particular operation. These handler functions and eval are <code>mutally recursive</code>, and note that every function has to have the <code>Env</code> passed to it as an implicit parameter, yet only <code>Var</code> needs it. This will be important later.
</p>

<p>
Here's the eval function and handlers.
</p>

<div class="org-src-container">
<pre class="src src-scala"><span style="color: #b6a0ff;">def</span> <span style="color: #feacd0;">eval</span>(exp<span style="color: #b6a0ff;">:</span> <span style="color: #6ae4b9;">Exp</span>)(<span style="color: #f78fe7;">implicit</span> env <span style="color: #b6a0ff;">:</span> <span style="color: #6ae4b9;">Env</span>)<span style="color: #b6a0ff;">:</span> <span style="color: #6ae4b9;">Int</span> <span style="color: #b6a0ff;">=</span> {
  exp <span style="color: #b6a0ff;">match</span> {
    <span style="color: #b6a0ff;">case</span> <span style="color: #6ae4b9;">Var</span>(<span style="color: #00d3d0;">id</span>) <span style="color: #b6a0ff;">=&gt;</span> handleVar(id)
    <span style="color: #b6a0ff;">case</span> <span style="color: #6ae4b9;">Val</span>(<span style="color: #00d3d0;">value</span>) <span style="color: #b6a0ff;">=&gt;</span> value
    <span style="color: #b6a0ff;">case</span> <span style="color: #6ae4b9;">Add</span>(<span style="color: #00d3d0;">l</span>,<span style="color: #00d3d0;">r</span>) <span style="color: #b6a0ff;">=&gt;</span> handleAdd(l,r)
    <span style="color: #b6a0ff;">case</span> <span style="color: #6ae4b9;">Mul</span>(<span style="color: #00d3d0;">l</span>,<span style="color: #00d3d0;">r</span>) <span style="color: #b6a0ff;">=&gt;</span> handleMul(l,r)
  }
}

<span style="color: #b6a0ff;">def</span> <span style="color: #feacd0;">handleAdd</span>(l<span style="color: #b6a0ff;">:</span> <span style="color: #6ae4b9;">Exp</span>, r<span style="color: #b6a0ff;">:</span> <span style="color: #6ae4b9;">Exp</span>)(<span style="color: #f78fe7;">implicit</span> env <span style="color: #b6a0ff;">:</span> <span style="color: #6ae4b9;">Env</span>) <span style="color: #b6a0ff;">=</span> eval(l) + eval(r)
<span style="color: #b6a0ff;">def</span> <span style="color: #feacd0;">handleMul</span>(l<span style="color: #b6a0ff;">:</span> <span style="color: #6ae4b9;">Exp</span>, r<span style="color: #b6a0ff;">:</span> <span style="color: #6ae4b9;">Exp</span>)(<span style="color: #f78fe7;">implicit</span> env <span style="color: #b6a0ff;">:</span> <span style="color: #6ae4b9;">Env</span>) <span style="color: #b6a0ff;">=</span> eval(l) * eval(r)
<span style="color: #b6a0ff;">def</span> <span style="color: #feacd0;">handleVar</span>(s<span style="color: #b6a0ff;">:</span> <span style="color: #6ae4b9;">String</span>)(<span style="color: #f78fe7;">implicit</span> env<span style="color: #b6a0ff;">:</span> <span style="color: #6ae4b9;">Env</span>) <span style="color: #b6a0ff;">=</span> env.getOrElse(s, <span style="color: #00bcff;">0</span>)
</pre>
</div>

<p>
Note that we could have inlined these functions in eval, but it a larger example it's important to break things out to keep things managable.
</p>

<p>
That is all the implementation we need, and all that remains is to create an expression, create an environment (declared implicit so Scala knows to include it as an implicit when eval is called) and print the result of evaluating the expression.
</p>

<div class="org-src-container">
<pre class="src src-scala"><span style="color: #b6a0ff;">val</span> <span style="color: #00d3d0;">exp1</span> <span style="color: #b6a0ff;">:</span> <span style="color: #6ae4b9;">Exp</span> <span style="color: #b6a0ff;">=</span> <span style="color: #00bcff;">Mul</span>(<span style="color: #00bcff;">Var</span>(<span style="color: #79a8ff;">"z"</span>), <span style="color: #00bcff;">Add</span>(<span style="color: #00bcff;">Val</span>(<span style="color: #00bcff;">30</span>), <span style="color: #00bcff;">Mul</span>(<span style="color: #00bcff;">Var</span>(<span style="color: #79a8ff;">"x"</span>), <span style="color: #00bcff;">Var</span>(<span style="color: #79a8ff;">"y"</span>))))

<span style="color: #f78fe7;">implicit</span> <span style="color: #b6a0ff;">val</span> <span style="color: #00d3d0;">env</span> <span style="color: #b6a0ff;">:</span> <span style="color: #6ae4b9;">Env</span> <span style="color: #b6a0ff;">=</span> <span style="color: #00bcff;">Map</span>(<span style="color: #79a8ff;">"x"</span> -&gt; <span style="color: #00bcff;">17</span>, <span style="color: #79a8ff;">"y"</span> -&gt; <span style="color: #00bcff;">10</span>, <span style="color: #79a8ff;">"z"</span> -&gt; <span style="color: #00bcff;">2</span>)
<span style="color: #b6a0ff;">val</span> <span style="color: #00d3d0;">eval1</span> <span style="color: #b6a0ff;">=</span> eval(exp1)

println(s<span style="color: #79a8ff;">"Eval exp gives </span><span style="color: #00d3d0;">$eval1</span><span style="color: #79a8ff;">"</span>)
</pre>
</div>

<p>
You can compile and run the code to see this working. The code is here. <a href="https://github.com/justinhj/evalexample/blob/master/src/main/scala/Scala2Eval.scala">https://github.com/justinhj/evalexample/blob/master/src/main/scala/Scala2Eval.scala</a>
</p>
</div>
</div>
