org/posts/2020-11-18-scala-3-context-functions.org
** Fun with Enum
Scala enums have been improved greatly. For one they are very simple to create and use just as in other languages.

#+BEGIN_SRC scala
 enum StatusCode:
    case OK, TimedOut, Error
#+END_SRC

Here we've defined three enums that have ordinal values 0 to 2. You can access the ordinal value with the ~.ordinal~ method, convert ordinal values to Enums using ~.fromOrdinal~ and convert Strings to enums (assuming they match) with ~.valueOf~.

#+BEGIN_SRC scala
  println(s"Ordinal value of StatusCode.Error is ${StatusCode.Error.ordinal}")
  println(s"StatusCode from ordinal 1 is ${StatusCode.fromOrdinal(1)}")
  println(s"StatusCode from string OK is ${StatusCode.valueOf("OK")}")

  // Ordinal value of StatusCode.Error is 2
  // StatusCode from ordinal 1 is TimedOut
  // StatusCode from string OK is OK
#+END_SRC

You can also add your own parameters and definitions to enums. The underlying ordinal values are still there. For example you could encode Http Status codes as follows.

#+BEGIN_SRC scala 
enum HttpStatusCode(code: Int) {
  case OK extends HttpStatusCode(200)
  case NotModified extends HttpStatusCode(304)
  case Forbidden extends HttpStatusCode(404)

  def isSuccess = code >= 200 && code < 300
}
#+END_SRC

Scala 3 team also took the opportunity to make Enums ~a more concise notation for ADTs and GADTs~. For our purposes that means we can simply the definition of ~Exp~ as follows.

#+BEGIN_SRC scala
enum Exp {
  case Val(value: Int) extends Exp
  case Add(left: Exp, right: Exp) extends Exp
  case Var(identifier: String) extends Exp
}
#+END_SRC

In fact you can further simplify to the following (you could also remove the braces).

#+BEGIN_SRC scala
enum Exp {
  case Val(value: Int)
  case Add(left: Exp, right: Exp)
  case Var(identifier: String)
}
#+END_SRC

** Explicit implicits
A focus of the Scala 3 team is to help beginners access the language and in particular simplifying implicits. There are many subtle changes here but two obvious ones are that you now have different keywords for implicit parameters and creating implicit instances. In our code this means that when we supply the implicit symbol table to eval we now use the new ~given~ syntax instead of ~implicit~.

#+BEGIN_SRC scala
implicit val env : Env = Map("x" -> 17, "y" -> 10, "z" -> 2)
#+END_SRC

becomes...

#+BEGIN_SRC scala
given envMap: Env = Map("x" -> 7, "y" -> 6, "z" -> 22)
#+END_SRC

Similarly, the method parameters now no longer use the implicit keyword and instead you prefix the parameter name with ~using~.

#+BEGIN_SRC
def eval(exp: Exp)(implicit env : Env): Int
#+END_SRC

becomes...

#+BEGIN_SRC scala
def eval(exp: Exp)(using env : Env): Int
#+END_SRC

You don't have to change your Scala 2 code at this point, it is still compatible, but for new code and in the long term you should gradually eliminate implicit.

