_posts/2020-11-18-scala-3-context-functions.html

<div id="outline-container-orgb5b329b" class="outline-2">
<h2 id="orgb5b329b">Fun with Enum</h2>
<div class="outline-text-2" id="text-orgb5b329b">
<p>
Scala enums have been improved greatly. For one they are very simple to create and use just as in other languages.
</p>

<div class="org-src-container">
<pre class="src src-scala">enum <span style="color: #00bcff;">StatusCode</span><span style="color: #b6a0ff;">:</span>
   <span style="color: #b6a0ff;">case</span> <span style="color: #00bcff;">OK</span>, <span style="color: #00bcff;">TimedOut</span>, <span style="color: #00bcff;">Error</span>
</pre>
</div>

<p>
Here we've defined three enums that have ordinal values 0 to 2. You can access the ordinal value with the <code>.ordinal</code> method, convert ordinal values to Enums using <code>.fromOrdinal</code> and convert Strings to enums (assuming they match) with <code>.valueOf</code>.
</p>

<div class="org-src-container">
<pre class="src src-scala">println(s<span style="color: #79a8ff;">"Ordinal value of StatusCode.Error is </span><span style="color: #00d3d0;">${StatusCode.Error.ordinal}</span><span style="color: #79a8ff;">"</span>)
println(s<span style="color: #79a8ff;">"StatusCode from ordinal 1 is </span><span style="color: #00d3d0;">${StatusCode.fromOrdinal(1)}</span><span style="color: #79a8ff;">"</span>)
println(s<span style="color: #79a8ff;">"StatusCode from string OK is </span><span style="color: #00d3d0;">${StatusCode.valueOf("OK")}</span><span style="color: #79a8ff;">"</span>)

<span style="color: #a8a8a8;">// </span><span style="color: #a8a8a8;">Ordinal value of StatusCode.Error is 2</span>
<span style="color: #a8a8a8;">// </span><span style="color: #a8a8a8;">StatusCode from ordinal 1 is TimedOut</span>
<span style="color: #a8a8a8;">// </span><span style="color: #a8a8a8;">StatusCode from string OK is OK</span>
</pre>
</div>

<p>
You can also add your own parameters and definitions to enums. The underlying ordinal values are still there. For example you could encode Http Status codes as follows.
</p>

<div class="org-src-container">
<pre class="src src-scala">enum <span style="color: #00bcff;">HttpStatusCode</span>(code<span style="color: #b6a0ff;">:</span> <span style="color: #6ae4b9;">Int</span>) {
  <span style="color: #b6a0ff;">case</span> <span style="color: #00bcff;">OK</span> <span style="color: #b6a0ff;">extends</span> <span style="color: #6ae4b9;">HttpStatusCode</span>(<span style="color: #00bcff;">200</span>)
  <span style="color: #b6a0ff;">case</span> <span style="color: #00bcff;">NotModified</span> <span style="color: #b6a0ff;">extends</span> <span style="color: #6ae4b9;">HttpStatusCode</span>(<span style="color: #00bcff;">304</span>)
  <span style="color: #b6a0ff;">case</span> <span style="color: #00bcff;">Forbidden</span> <span style="color: #b6a0ff;">extends</span> <span style="color: #6ae4b9;">HttpStatusCode</span>(<span style="color: #00bcff;">404</span>)

  <span style="color: #b6a0ff;">def</span> <span style="color: #feacd0;">isSuccess</span> <span style="color: #b6a0ff;">=</span> code &gt;= <span style="color: #00bcff;">200</span> &amp;&amp; code &lt; <span style="color: #00bcff;">300</span>
}
</pre>
</div>

<p>
Scala 3 team also took the opportunity to make Enums <code>a more concise notation for ADTs and GADTs</code>. For our purposes that means we can simply the definition of <code>Exp</code> as follows.
</p>

<div class="org-src-container">
<pre class="src src-scala">enum <span style="color: #00bcff;">Exp</span> {
  <span style="color: #b6a0ff;">case</span> <span style="color: #6ae4b9;">Val</span>(<span style="color: #00d3d0;">value</span><span style="color: #b6a0ff;">:</span> <span style="color: #6ae4b9;">Int</span>) <span style="color: #b6a0ff;">extends</span> <span style="color: #6ae4b9;">Exp</span>
  <span style="color: #b6a0ff;">case</span> <span style="color: #6ae4b9;">Add</span>(<span style="color: #00d3d0;">left</span><span style="color: #b6a0ff;">:</span> <span style="color: #6ae4b9;">Exp</span>, <span style="color: #00d3d0;">right</span><span style="color: #b6a0ff;">:</span> <span style="color: #6ae4b9;">Exp</span>) <span style="color: #b6a0ff;">extends</span> <span style="color: #6ae4b9;">Exp</span>
  <span style="color: #b6a0ff;">case</span> <span style="color: #6ae4b9;">Var</span>(<span style="color: #00d3d0;">identifier</span><span style="color: #b6a0ff;">:</span> <span style="color: #6ae4b9;">String</span>) <span style="color: #b6a0ff;">extends</span> <span style="color: #6ae4b9;">Exp</span>
}
</pre>
</div>

<p>
In fact you can further simplify to the following (you could also remove the braces).
</p>

<div class="org-src-container">
<pre class="src src-scala">enum <span style="color: #00bcff;">Exp</span> {
  <span style="color: #b6a0ff;">case</span> <span style="color: #6ae4b9;">Val</span>(<span style="color: #00d3d0;">value</span><span style="color: #b6a0ff;">:</span> <span style="color: #6ae4b9;">Int</span>)
  <span style="color: #b6a0ff;">case</span> <span style="color: #6ae4b9;">Add</span>(<span style="color: #00d3d0;">left</span><span style="color: #b6a0ff;">:</span> <span style="color: #6ae4b9;">Exp</span>, <span style="color: #00d3d0;">right</span><span style="color: #b6a0ff;">:</span> <span style="color: #6ae4b9;">Exp</span>)
  <span style="color: #b6a0ff;">case</span> <span style="color: #6ae4b9;">Var</span>(<span style="color: #00d3d0;">identifier</span><span style="color: #b6a0ff;">:</span> <span style="color: #6ae4b9;">String</span>)
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf9c19ca" class="outline-2">
<h2 id="orgf9c19ca">Explicit implicits</h2>
<div class="outline-text-2" id="text-orgf9c19ca">
<p>
A focus of the Scala 3 team is to help beginners access the language and in particular simplifying implicits. There are many subtle changes here but two obvious ones are that you now have different keywords for implicit parameters and creating implicit instances. In our code this means that when we supply the implicit symbol table to eval we now use the new <code>given</code> syntax instead of <code>implicit</code>.
</p>

<div class="org-src-container">
<pre class="src src-scala"><span style="color: #f78fe7;">implicit</span> <span style="color: #b6a0ff;">val</span> <span style="color: #00d3d0;">env</span> <span style="color: #b6a0ff;">:</span> <span style="color: #6ae4b9;">Env</span> <span style="color: #b6a0ff;">=</span> <span style="color: #00bcff;">Map</span>(<span style="color: #79a8ff;">"x"</span> -&gt; <span style="color: #00bcff;">17</span>, <span style="color: #79a8ff;">"y"</span> -&gt; <span style="color: #00bcff;">10</span>, <span style="color: #79a8ff;">"z"</span> -&gt; <span style="color: #00bcff;">2</span>)
</pre>
</div>

<p>
becomes&#x2026;
</p>

<div class="org-src-container">
<pre class="src src-scala">given envMap<span style="color: #b6a0ff;">:</span> <span style="color: #6ae4b9;">Env</span> <span style="color: #b6a0ff;">=</span> <span style="color: #00bcff;">Map</span>(<span style="color: #79a8ff;">"x"</span> -&gt; <span style="color: #00bcff;">7</span>, <span style="color: #79a8ff;">"y"</span> -&gt; <span style="color: #00bcff;">6</span>, <span style="color: #79a8ff;">"z"</span> -&gt; <span style="color: #00bcff;">22</span>)
</pre>
</div>

<p>
Similarly, the method parameters now no longer use the implicit keyword and instead you prefix the parameter name with <code>using</code>.
</p>

<pre class="example">
def eval(exp: Exp)(implicit env : Env): Int
</pre>

<p>
becomes&#x2026;
</p>

<div class="org-src-container">
<pre class="src src-scala"><span style="color: #b6a0ff;">def</span> <span style="color: #feacd0;">eval</span>(exp<span style="color: #b6a0ff;">:</span> <span style="color: #6ae4b9;">Exp</span>)(using env <span style="color: #b6a0ff;">:</span> <span style="color: #6ae4b9;">Env</span>)<span style="color: #b6a0ff;">:</span> <span style="color: #6ae4b9;">Int</span>
</pre>
</div>

<p>
You don't have to change your Scala 2 code at this point, it is still compatible, but for new code and in the long term you should gradually eliminate implicit.
</p>
</div>
</div>
