_posts/2020-11-18-scala-3-context-functions.html

<div id="outline-container-org08f0809" class="outline-2">
<h2 id="org08f0809">Context Functions</h2>
<div class="outline-text-2" id="text-org08f0809">
<p>
Last and not at all least are context functions. This gives us one more opportunity to remove boiler plate from the eval code. When you create a regular function value it has a type like <code>Function1[A,B]</code>. In other words it is a function that takes a value A and returns vale of type B. Context Functions are a new function value type (this is synthesized by the compiler so you won't see it your code), with an input and an output type. The difference is that the input is understood to be provided implicitly.
</p>

<p>
Let's make this more concrete. Assume you have a function that needs an <code>ExecutionContext</code>. We can make a Context Function type that will take an implicit execution context and return some paramaterized type T.
</p>

<div class="org-src-container">
<pre class="src src-scala"><span style="color: #b6a0ff;">type</span> <span style="color: #00bcff;">Executable</span>[<span style="color: #00bcff;">T</span>] <span style="color: #b6a0ff;">=</span> <span style="color: #00bcff;">ExecutionContext</span> ?=&gt; <span style="color: #00bcff;">T</span>
</pre>
</div>

<p>
How would that be used in a real program? Let's say you have some deeply nested function (f4 in the code below) and it is only down at that level you need the implicit execution context. Without implicit parameters you'd add the ExecutionContext parameter to every single function call all the way down and then have to take care to pass it along. With Scala 2 implicits you still have to declare the parameter but you can make it implicit and avoid the burden of manually passing it along.
</p>

<p>
With Scala 3 you can define the function to be of type <code>Executable[T]</code> and then we don't need to even name the implicit parameter, we just know that it will be included automatically all the way down. Here is a complete example.
</p>

<div class="org-src-container">
<pre class="src src-scala"><span style="color: #b6a0ff;">import</span> scala.concurrent.{<span style="color: #00bcff;">Future</span>, <span style="color: #00bcff;">ExecutionContext</span>, <span style="color: #00bcff;">Await</span>}
<span style="color: #b6a0ff;">import</span> scala.concurrent.duration.<span style="color: #b6a0ff;">_</span>
<span style="color: #b6a0ff;">import</span> scala.language.postfixOps

<span style="color: #b6a0ff;">object</span> <span style="color: #00bcff;">Executable</span> <span style="color: #b6a0ff;">extends</span> <span style="color: #6ae4b9;">App</span> {

  <span style="color: #b6a0ff;">type</span> <span style="color: #00bcff;">Executable</span>[<span style="color: #00bcff;">T</span>] <span style="color: #b6a0ff;">=</span> <span style="color: #00bcff;">ExecutionContext</span> ?=&gt; <span style="color: #00bcff;">T</span>

  <span style="color: #b6a0ff;">def</span> <span style="color: #feacd0;">f1</span>(n<span style="color: #b6a0ff;">:</span> <span style="color: #6ae4b9;">Int</span>)<span style="color: #b6a0ff;">:</span> <span style="color: #6ae4b9;">Executable</span>[<span style="color: #00bcff;">Future</span>[<span style="color: #00bcff;">Int</span>]] <span style="color: #b6a0ff;">=</span> f2(n + <span style="color: #00bcff;">1</span>)
  <span style="color: #b6a0ff;">def</span> <span style="color: #feacd0;">f2</span>(n<span style="color: #b6a0ff;">:</span> <span style="color: #6ae4b9;">Int</span>)<span style="color: #b6a0ff;">:</span> <span style="color: #6ae4b9;">Executable</span>[<span style="color: #00bcff;">Future</span>[<span style="color: #00bcff;">Int</span>]] <span style="color: #b6a0ff;">=</span> f3(n + <span style="color: #00bcff;">1</span>)
  <span style="color: #b6a0ff;">def</span> <span style="color: #feacd0;">f3</span>(n<span style="color: #b6a0ff;">:</span> <span style="color: #6ae4b9;">Int</span>)<span style="color: #b6a0ff;">:</span> <span style="color: #6ae4b9;">Executable</span>[<span style="color: #00bcff;">Future</span>[<span style="color: #00bcff;">Int</span>]] <span style="color: #b6a0ff;">=</span> f4(n + <span style="color: #00bcff;">1</span>)
  <span style="color: #b6a0ff;">def</span> <span style="color: #feacd0;">f4</span>(n<span style="color: #b6a0ff;">:</span> <span style="color: #6ae4b9;">Int</span>)<span style="color: #b6a0ff;">:</span> <span style="color: #6ae4b9;">Executable</span>[<span style="color: #00bcff;">Future</span>[<span style="color: #00bcff;">Int</span>]] <span style="color: #b6a0ff;">=</span> {
    <span style="color: #b6a0ff;">val</span> <span style="color: #00d3d0;">ex</span> <span style="color: #b6a0ff;">=</span> summon[<span style="color: #00bcff;">ExecutionContext</span>]
    <span style="color: #00bcff;">Future</span> {
      println(s<span style="color: #79a8ff;">"Hi from the future! n is </span><span style="color: #00d3d0;">$n</span><span style="color: #79a8ff;">"</span>)
      n
    }
  }

  {
    given ec<span style="color: #b6a0ff;">:</span> <span style="color: #6ae4b9;">ExecutionContext</span> <span style="color: #b6a0ff;">=</span> scala.concurrent.<span style="color: #00bcff;">ExecutionContext</span>.global
    <span style="color: #00bcff;">Await</span>.result(f1(<span style="color: #00bcff;">10</span>), <span style="color: #00bcff;">1</span> second)
    <span style="color: #a8a8a8;">// </span><span style="color: #a8a8a8;">Hi from the future! n is 13</span>
  }

}
</pre>
</div>

<p>
Context functions reduce boilerplate when dealing with implicit parameters in deeply nested code. We can apply this technique to our eval function so that the symbol table itself is the implicit piece of context.
</p>

<div class="org-src-container">
<pre class="src src-scala"><span style="color: #b6a0ff;">type</span> <span style="color: #00bcff;">WithEnv</span> <span style="color: #b6a0ff;">=</span> <span style="color: #00bcff;">Env</span> ?=&gt; <span style="color: #00bcff;">Int</span>

<span style="color: #b6a0ff;">def</span> <span style="color: #feacd0;">eval</span>(exp<span style="color: #b6a0ff;">:</span> <span style="color: #6ae4b9;">Exp</span>)<span style="color: #b6a0ff;">:</span> <span style="color: #6ae4b9;">WithEnv</span> <span style="color: #b6a0ff;">=</span>
  exp <span style="color: #b6a0ff;">match</span> {
    <span style="color: #b6a0ff;">case</span> <span style="color: #6ae4b9;">Var</span>(<span style="color: #00d3d0;">id</span>) <span style="color: #b6a0ff;">=&gt;</span> handleVar(id)
    <span style="color: #b6a0ff;">case</span> <span style="color: #6ae4b9;">Val</span>(<span style="color: #00d3d0;">value</span>) <span style="color: #b6a0ff;">=&gt;</span> value
    <span style="color: #b6a0ff;">case</span> <span style="color: #6ae4b9;">Add</span>(<span style="color: #00d3d0;">l</span>,<span style="color: #00d3d0;">r</span>) <span style="color: #b6a0ff;">=&gt;</span> handleAdd(l,r)
  }

<span style="color: #b6a0ff;">def</span> <span style="color: #feacd0;">handleAdd</span>(l<span style="color: #b6a0ff;">:</span> <span style="color: #6ae4b9;">Exp</span>, r<span style="color: #b6a0ff;">:</span> <span style="color: #6ae4b9;">Exp</span>)<span style="color: #b6a0ff;">:</span> <span style="color: #6ae4b9;">WithEnv</span> <span style="color: #b6a0ff;">=</span> eval(l) + eval(r)

<span style="color: #b6a0ff;">def</span> <span style="color: #feacd0;">handleVar</span>(s<span style="color: #b6a0ff;">:</span> <span style="color: #6ae4b9;">String</span>)<span style="color: #b6a0ff;">:</span> <span style="color: #6ae4b9;">WithEnv</span> <span style="color: #b6a0ff;">=</span>
  <span style="color: #b6a0ff;">val</span> <span style="color: #00d3d0;">env</span> <span style="color: #b6a0ff;">=</span> summon[<span style="color: #00bcff;">Env</span>]
  env.getOrElse(s, <span style="color: #00bcff;">0</span>)
</pre>
</div>

<p>
You can take a look at the final Scala 3 version of the code here.
</p>

<p>
<a href="https://github.com/justinhj/evalexample/blob/master/src/main/scala/Scala3Eval.scala">https://github.com/justinhj/evalexample/blob/master/src/main/scala/Scala3Eval.scala</a>
</p>
</div>
</div>

<div id="outline-container-org7baa236" class="outline-2">
<h2 id="org7baa236">Final notes</h2>
<div class="outline-text-2" id="text-org7baa236">
<p>
Of all the new features in Scala 3, I found Context Functions of most interest because of Martin Odersky's blog from 2016 <a href="https://www.scala-lang.org/blog/2016/12/07/implicit-function-types.html">https://www.scala-lang.org/blog/2016/12/07/implicit-function-types.html</a> where this intriguing quote appears near the end. (Context functions were initially known as implicit functions).
</p>

<blockquote>
<p>
There are many interesting connections with category theory to explore here. On the one hand, implicit functions are used for tasks that are sometimes covered with monads such as the reader monad. There’s an argument to be made that implicits have better composability than monads and why that is.
</p>

<p>
On the other hand, it turns out that implicit functions can also be given a co-monadic interpretation, and the interplay between monads and comonads is very interesting in its own right.
</p>

<p>
But these discussions will have to wait for another time, as this blog post is already too long.
</p>
</blockquote>

<p>
Somewhat of a Fermat's last theorem moment there, and I am also interested in how we can represent concepts, that are currently implemented in libraries which model category theory, using vanilla Scala 3 or alternative representations.
</p>
</div>
</div>

<div id="outline-container-orga7482f9" class="outline-2">
<h2 id="orga7482f9">References</h2>
<div class="outline-text-2" id="text-orga7482f9">
<p>
<a href="https://en.wikiquote.org/wiki/Pierre_de_Fermat">https://en.wikiquote.org/wiki/Pierre_de_Fermat</a>
</p>

<p>
<a href="https://dotty.epfl.ch/docs/reference/enums/enums.html">https://dotty.epfl.ch/docs/reference/enums/enums.html</a>
<a href="https://dotty.epfl.ch/docs/reference/enums/adts.html">https://dotty.epfl.ch/docs/reference/enums/adts.html</a>
</p>

<p>
<a href="http://dotty.epfl.ch/docs/reference/other-new-features/indentation.html">http://dotty.epfl.ch/docs/reference/other-new-features/indentation.html</a>
</p>

<p>
<a href="https://dotty.epfl.ch/docs/reference/contextual/givens.html">https://dotty.epfl.ch/docs/reference/contextual/givens.html</a> <a href="https://dotty.epfl.ch/docs/reference/contextual/using-clauses.html">https://dotty.epfl.ch/docs/reference/contextual/using-clauses.html</a>
</p>

<p>
<a href="https://dotty.epfl.ch/docs/reference/contextual/context-functions.html">https://dotty.epfl.ch/docs/reference/contextual/context-functions.html</a>
</p>

<p>
Foundations and Applications of Implicit Function Types
<a href="https://infoscience.epfl.ch/record/229878/files/simplicitly_1.pdf">https://infoscience.epfl.ch/record/229878/files/simplicitly_1.pdf</a>
</p>

<p>
<a href="http://recurse.se/2019/09/implicit-functions-in-scala-3/">http://recurse.se/2019/09/implicit-functions-in-scala-3/</a>
</p>

<p>
&copy; 2020 Justin Heyes-Jones. All Rights Reserved.
</p>
</div>
</div>
